
Функция ПолучитьСписокОбновлений1СПолучитьСписок(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Конифигурация1С = Запрос.ПараметрыURL["conf"];
	Релиз  			= Запрос.ПараметрыURL["version"]; 
	
	//Конифигурация1С = "HRM";	//SmallBusiness  ИмяТекущейПрограммы
	//Релиз = "3.1.23.460";		//ВерсияТекущейПрограммы 
	//http://localhost/billing/hs/listupdates1s/HRM/3.1.23.460   
	//										   /Accounting/3.0.147.30
	
	РезультатUpdate = ПолучениеСпискаОбновлений1С.ПолучитьВерсииОбновленийНаСервере(Конифигурация1С, Релиз); 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, РезультатUpdate.ОбновленияКонфигурации);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.Использовать);
	
	Возврат Ответ;
	
КонецФункции
