
Функция ПолучитьСписокОбновлений1СПолучитьСписок(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Конифигурация1С = Запрос.ПараметрыURL["conf"];
	Релиз  			= Запрос.ПараметрыURL["version"]; 
		
	РезультатUpdate = ПолучениеСпискаОбновлений1С.ПолучитьВерсииОбновленийНаСервере(Конифигурация1С, Релиз); 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, РезультатUpdate.ОбновленияКонфигурации);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.Использовать);
	
	Возврат Ответ;
	
КонецФункции
